
let a = prompt('Скільки тобі років?');
let b = '';

if (isNaN(a) || a === " "){  // проверка на число
    alert('Необхідно ввести число! Оновіть сторінку та введіть число.');
}
else
    if (a < 0){ // проверка на положительное число
    alert('Вік не може бути від\'ємним! Оновіть сторінку та введіть число більше за нуль.');
}
    else
if (a === 1) {  //обработка значений "рік" для значения ввода 1
    b += "рік"
}
else
    if (a % 10 === 1 && a % 100 !== 11) { //обработка значений "рік" с исключением всех значений у которых остаток от деления = 11
    b += "pik"
}
else
    if ((a % 10 >= 2 && a % 10 <= 4) && (a % 100 < 10 || a % 100 >= 20)) {  // обработка значений "роки"
    b += "роки"
}
    else {b += "років"}  //всё остальное "років"

alert(a + " "+ b);
